#ჩამოწერეთ რამდენი არგუმენტი შეიძლება გადაეცეს range()ფუნქცია და ახსენით რომელი რას აკეთებს
#როცა გადაეცემა 1 არგუმენტი, ნიშნავს რომ გამოიტანს იქამდე რა არგუმენტიც გადაეცა
#როცა გადაეცემა 2 არგუმენტი, მაშინ პირველი არგუმენტი გვეუბნება იმას თუ საიდან უნდა დაიწყოს ათვლა
#ხოლო მეორე არგუმენტი გვეუბნება თუ სადამდე უნდა გაგრძელდეს
#როცა გადაეცემა 2 არგუმენტი, მაშინ პირველი არგუმენტი გვეუბნება იმას თუ საიდან უნდა დაიწყოს ათვლა,
#მეორე არგუმენტი გვეუბნება თუ სადამდე უნდა გაგრძელდეს, ხოლო მესამე არგუმენტი გვეუბნება თუ რამდენი
#უნდა მოემატოს ყოველ იტერაციაზე