#რას ნიშნავს if?elif?else?
#if, elif და else არის პირობითი სტრუქტურები პროგრამირების ენებში, რომლებიც საშუალებას გვაძლევს გავაკეთოთ გადაწყვეტილებები კოდის შესრულების დროს.
#If გამოიყენება იმისთვის, რომ შემოწმდეს თუ გარკვეული პირობა არის სიმართლე (true) და თუ არის,
#მაშინ შესრულდება შესაბამისი კოდის ბლოკი.
#Elif (else if) გამოიყენება დამატებითი პირობის შემოწმებისთვის, თუ წინა if პირობა არ შესრულდა.
#Finally, else გამოიყენება იმისთვის, რომ შესრულდეს კოდის ბლოკი, თუ არც if და არც რომელიმე elif პირობა არ შესრულდა.