# მომხარებელს შემოატანინეტ ორი ინტეერი input ის საშულაბიეთ,
#  შემდეგ შექმენით სია 10 ცალი ნებისმიერი ელემენტითი,
#  და შემდეგ ამ სიაში ამოჭერით ელემენტი მომხარებლის პირველი შემოტანილი რიცხვის ინდექსიდან მომხარებლის მეორე შემოტანილი 
# რიცხვის ინდექსამდე

# მაგ:  input1: 2
#      input2: 6
# arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# output: 3, 4, 5, 6
input1 = int(input("Enter the first number (0-9): "))
input2 = int(input("Enter the second number (0-9): "))
arr = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
sliced_arr = arr[input1:input2]
print( sliced_arr)