#შექმენით სია, 10 ელემენტით, ნებისმიერი მონაცემთა ტიპის, შემდეგ მომხარებელს შემოატანინეთ 2 ცალი რიცხვი,
#პირველი რიცხვი რაც შემოიტანეს მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ,
#და  მეორე რიცხვი რაც შემოიტანეს სიაში მაგ ინდექსზე მდგომი ელემენტი შეცვალეთ "new element" ით
elements = ["apple", 42, 3.14, True, "banana", 7, False, "cherry", 100, 2.71]
first_index = int(input("შეიტანეთ პირველი რიცხვი (ინდექსი 0-დან 9-მდე): "))
print( elements[first_index])
second_index = int(input("შეიტანეთ მეორე რიცხვი (ინდექსი 0-დან 9-მდე): "))
elements[second_index] = "new element"
print(elements)